In [1]:
import pandas as pd

data = pd.read_csv("holiday.csv")

data["rating"] / 2

0     2.0
1     2.0
2     1.5
3     1.5
4     1.5
5     2.0
6     2.0
7     2.0
8     1.5
9     1.5
10    1.5
11    1.5
12    1.5
13    2.5
14    2.0
15    1.5
Name: rating, dtype: float64

In [2]:
import pandas as pd 

data = pd.read_csv("holiday.csv")

data["rating"] * 10

0     40
1     40
2     30
3     30
4     30
5     40
6     40
7     40
8     30
9     30
10    30
11    30
12    30
13    50
14    40
15    30
Name: rating, dtype: int64

In [4]:
import pandas as pd 

data = pd.read_csv("holiday.csv")

myfilter = data["scores"] > 8

myfilter

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14     True
15    False
Name: scores, dtype: bool

In [13]:
import pandas as pd

data = pd.read_csv("holiday.csv")
data[(data.scores > 8) & (data.Avaliabilty =="no")]

,Column,Outbound,Inbound,Hotel,IN,OUT,prices,Nights,scores,Avaliabilty,Most Visted City,rating
6,6,London Stansted,Fuerteventura,SBH Taro Beach Hotel,Tue 24 May,Tue 31 May,"£1,021",7,9.0,no,2000000,4
14,14,London Heathrow,"Punta Cana, Dominican Republic(PUJ)",Whala Bayahibe,Wed 14 Sep,Fri 23 Sep,"£1,296",9,9.0,no,1230000,4

In [20]:
import pandas as pd

data = pd.read_csv("holiday.csv")
data[(data.scores < 8) & (data.rating == 3)]

,Column,Outbound,Inbound,Hotel,IN,OUT,prices,Nights,scores,Avaliabilty,Most Visted City,rating
8,8,London Stansted,Corfu,Flori Hotel,Wed 27 Apr,Wed 4 May,£344,7,6.0,no,1000000,3
9,9,Leeds Bradford,Palma Mallorca,Bellevue Club,Sat 2 Apr,Thu 7 Apr,£312,5,3.0,yes,250000,3
10,10,Birmingham,Palma Mallorca,Eix Lagotel Holiday Resort,Sat 23 Apr,Thu 28 Apr,£261,5,7.0,no,5050000,3
11,11,Edinburgh,Tenerife Sur,Las Piramides,Wed 23 Mar,Wed 30 Mar,£563,7,5.0,yes,3200000,3
15,15,Manchester,Jose Marti,Marazul Hotel,Tue 6 sep,Tue 13 Sep,£597,7,6.0,yes,250000,3